app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" ORDER BY "employees"."id" ASC
---
  def index
    @employees = Employee.order(:id)

INSERT INTO "employees" ("first_name", "last_name", "email", "date_of_birth", "address", "country", "bio", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def fetch
    api_client = ApiClientService.new
    employees_data = api_client.fetch_employees

    employees_data.each do |data|
      Employee.find_or_create_from_api(data)